src/Documents/ВозвратКниги/ВозвратКниги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратКниги</name>
  <attributes>
    <name>Читатель</name>
    <type><types>CatalogRef.Читатели</types></type>
  </attributes>
  <registerRecords>AccumulationRegister.КнигиНаРуках</registerRecords>
  <registerRecords>AccumulationRegister.ШтрафыЧитателей</registerRecords>
  <tabularSections>
    <name>Книги</name>
    <attributes>
      <name>Книга</name>
      <type><types>CatalogRef.Книги</types></type>
    </attributes>
    <attributes>
      <name>КодЭкземпляра</name>
      <type><types>String</types><stringQualifiers><length>20</length></stringQualifiers></type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type><types>String</types><stringQualifiers><length>50</length></stringQualifiers></type>
    </attributes>
    <attributes>
      <name>Штраф</name>
      <type><types>Number</types><numberQualifiers><precision>15</precision><scale>2</scale></numberQualifiers></type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/КнигиНаРуках/КнигиНаРуках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КнигиНаРуках</name>
  <registerType>Balance</registerType>
  <dimensions>
    <name>Читатель</name>
    <type><types>CatalogRef.Читатели</types></type>
  </dimensions>
  <dimensions>
    <name>Книга</name>
    <type><types>CatalogRef.Книги</types></type>
  </dimensions>
  <dimensions>
    <name>КодЭкземпляра</name>
    <type><types>String</types><stringQualifiers><length>20</length></stringQualifiers></type>
  </dimensions>
  <resources>
    <name>Количество</name>
    <type><types>Number</types><numberQualifiers><precision>5</precision></numberQualifiers></type>
  </resources>
  <attributes>
    <name>ДатаВозврата</name>
    <type><types>Date</types><dateQualifiers><dateParts>Date</dateParts></dateQualifiers></type>
  </attributes>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ШтрафыЧитателей/ШтрафыЧитателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ШтрафыЧитателей</name>
  <registerType>Balance</registerType>
  <dimensions>
    <name>Читатель</name>
    <type><types>CatalogRef.Читатели</types></type>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type><types>Number</types><numberQualifiers><precision>15</precision><scale>2</scale></numberQualifiers></type>
  </resources>
</mdclass:AccumulationRegister>

src/InformationRegisters/ИсторияВыдач/ИсторияВыдач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияВыдач</name>
  <periodicity>Nonperiodical</periodicity>
  <writeMode>Independent</writeMode>
  <dimensions>
    <name>Читатель</name>
    <type><types>CatalogRef.Читатели</types></type>
  </dimensions>
  <dimensions>
    <name>КодЭкземпляра</name>
    <type><types>String</types><stringQualifiers><length>20</length></stringQualifiers></type>
  </dimensions>
  <dimensions>
    <name>ДатаВыдачи</name>
    <type><types>Date</types><dateQualifiers><dateParts>Date</dateParts></dateQualifiers></type>
  </dimensions>
  <resources>
    <name>Книга</name>
    <type><types>CatalogRef.Книги</types></type>
  </resources>
  <attributes>
    <name>ДатаВозврата</name>
    <type><types>Date</types><dateQualifiers><dateParts>Date</dateParts></dateQualifiers></type>
  </attributes>
  <attributes>
    <name>ФактДатаВозврата</name>
    <type><types>Date</types><dateQualifiers><dateParts>Date</dateParts></dateQualifiers></type>
  </attributes>
</mdclass:InformationRegister>

src/Documents/ВозвратКниги/ObjectModule.bsl
// @strict-types

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Движения по регистрам накопления
	Движения.КнигиНаРуках.Записывать    = Истина;
	Движения.ШтрафыЧитателей.Записывать = Истина;

	Для Каждого Строка Из Книги Цикл

		Движение = Движения.КнигиНаРуках.Добавить();
		Движение.ВидДвижения   = ВидДвиженияНакопления.Расход;
		Движение.Период        = Дата;
		Движение.Читатель      = Читатель;
		Движение.Книга         = Строка.Книга;
		Движение.КодЭкземпляра = Строка.КодЭкземпляра;
		Движение.Количество    = 1;

		Если Строка.Штраф > 0 Тогда
			ДвижШтраф = Движения.ШтрафыЧитателей.Добавить();
			ДвижШтраф.ВидДвижения = ВидДвиженияНакопления.Приход;
			ДвижШтраф.Период      = Дата;
			ДвижШтраф.Читатель    = Читатель;
			ДвижШтраф.Сумма       = Строка.Штраф;
		КонецЕсли;

	КонецЦикла;

	// Прямая запись факта возврата в регистр сведений ИсторияВыдач
	Для Каждого Строка Из Книги Цикл

		ЗапросИст = Новый Запрос;
		ЗапросИст.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИсторияВыдач.ДатаВыдачи КАК ДатаВыдачи
		|ИЗ
		|	РегистрСведений.ИсторияВыдач КАК ИсторияВыдач
		|ГДЕ
		|	ИсторияВыдач.Читатель      = &Читатель
		|	И ИсторияВыдач.КодЭкземпляра = &КодЭкземпляра
		|	И ИсторияВыдач.ФактДатаВозврата = ДАТАВРЕМЯ(1, 1, 1)
		|УПОРЯДОЧИТЬ ПО ИсторияВыдач.ДатаВыдачи УБЫВ";
		ЗапросИст.УстановитьПараметр("Читатель",      Читатель);
		ЗапросИст.УстановитьПараметр("КодЭкземпляра", Строка.КодЭкземпляра);
		РезИст = ЗапросИст.Выполнить().Выгрузить();

		Если РезИст.Количество() > 0 Тогда

			НаборЗаписей = РегистрыСведений.ИсторияВыдач.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Читатель.Установить(Читатель);
			НаборЗаписей.Отбор.КодЭкземпляра.Установить(Строка.КодЭкземпляра);
			НаборЗаписей.Отбор.ДатаВыдачи.Установить(РезИст[0].ДатаВыдачи);
			НаборЗаписей.Прочитать();

			Если НаборЗаписей.Количество() > 0 Тогда
				НаборЗаписей[0].ФактДатаВозврата = Дата;
				НаборЗаписей.Записать();
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	Движения.КнигиНаРуках.Записывать    = Истина;
	Движения.ШтрафыЧитателей.Записывать = Истина;

КонецПроцедуры

#КонецОбласти
